<template>
  <div class="content">
    <h2>Scroll 滚动条</h2>
    <h3>组件用法</h3>
    <p>①鼠标移入到内容上即可看到滚动条</p>
    <div style="height:50px;"></div>
    <scroll style="width: 300px; height:400px">
      <div class="content">
        <h4 style="margin-top:0;">早年经历</h4>
        <p>
          周杰伦出生于台湾省新北市，祖籍福建省泉州市永春县 [23]  。周杰伦4岁的
周杰伦小时候
周杰伦小时候(17张)
时候，母亲叶惠美把他送到淡江山叶幼儿音乐班学习钢琴 [24]  。周杰伦读初中二年级时，他的父母因性格不合离婚，而周杰伦则归母亲叶惠美抚养。中考时，周杰伦没有考上普通高中；同年，他因为擅长钢琴而被淡江中学第一届音乐班录取。高中毕业以后，他两次报考台北大学音乐系均没有被录取，于是他开始在一家餐馆打工 [24]  。
        </p>
        <h4>演艺经历</h4>
        <p>2000年，在杨峻荣的推荐下，周杰伦开始演唱自己创作的歌曲
周杰伦
周杰伦(7张)
；11月7日，发行首张个人专辑《Jay》，并包办全部歌曲的作曲、和声编写以及监制工作 [27]  ；该专辑融合了R&B、嘻哈等多种音乐风格 [28]  ，其中主打歌曲《星晴》获得第24届十大中文金曲优秀国语歌曲金奖 [29]  ，而周杰伦也凭借该专辑在华语乐坛受到关注，并于次年获得第12届台湾金曲奖最佳流行音乐演唱专辑奖、第12届台湾金曲奖最佳制作人提名、第12届台湾金曲奖最佳作曲人提名 [30-31]  。</p>
        <h4>感情生活</h4>
        <p>
          2014年11月17日，周杰伦正式公开了与昆凌的恋情 [171]  。2015年1月17日，周杰伦与昆凌在英国举行婚礼 [172-173]  ；2月9日，周杰伦与昆凌在台北举行泳池户外婚宴 [174]  ；3月9日，周杰伦、昆凌在澳洲举办家庭婚礼 [175-176]  ；7月12日，周杰伦与昆凌的女儿出生 [177]  。2017年2月13日，周杰伦宣布妻子怀二胎 [178]  ；6月8日，周杰伦与昆凌的儿子出生 [179]  。
        </p>

      </div>

    </scroll>
  </div>
</template>

<script>
import Scroll from '@/components/scroll/scroll'
export default {
  components: {
    Scroll
  }
}

</script>
<style lang='scss' scoped>
.content h4 {
  margin: 20px 0 12px 0;
}
</style>